In [1]:
import numpy as np
import pandas as pd
#when you combine series together,that is referred to as dataframes

In [3]:
#1.creating dataframe
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2=pd.DataFrame(data_list)
df2
columns=["Name","Age","City","Salary"]
df2=pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
#2.selection and indexing of columns
#to select one col-
df2[["Age"]]

   Age
0   28
1   34
2   29
3   42

In [8]:
#to select more than one columns,make list of list
df2[["Age","City"]]

   Age      City
0   28  New York
1   34     Paris
2   29    Berlin
3   42    London

In [38]:
#making new col-
df2["Food"]=["Apple","Banana","Mango","Orange"]
df2

    Name  Age      City  Salary    Food
0   John   28  New York   65000   Apple
1   Anna   34     Paris   70000  Banana
2  Peter   29    Berlin   62000   Mango
3  Linda   42    London   85000  Orange

In [39]:
#3. remove a col or more than 1 col
df2.drop(["Food"],axis=1,inplace=True)#use the inplace keyword,otherwise only copy is returned and not actually deleted
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [24]:
#4.selecting row
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [34]:
#selecting subset of rows and columns
df2.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [36]:
#conditional selection
df2[(df2["Age"]>30)&(df2["City"]=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000